# Terraform environment yt01
#### Format and Style 🖌`success`
#### Initialization ⚙️`success`
#### Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

[Lines containing Refreshing state removed]
[Truncated to 120000 bytes! See logoutput for complete plan]
Acquiring state lock. This may take a few moments...
module.rbac.data.azurerm_resource_group.spoke: Reading...
module.rbac_platform_app["0abd3bf5-4c0c-432a-8475-f977adc816c8"].data.azurerm_resource_group.spoke: Reading...
module.rbac_platform_app["05ca3a17-bfc2-432e-aea2-81176c47f176"].data.azurerm_resource_group.spoke: Reading...
module.appsettings.data.azurerm_resource_group.hub: Reading...
module.rbac.data.azurerm_resource_group.hub: Reading...
module.rbac_platform_app["0abd3bf5-4c0c-432a-8475-f977adc816c8"].data.azurerm_client_config.hub: Reading...
module.appsettings.data.azurerm_client_config.hub: Reading...
module.rbac.data.azurerm_client_config.hub: Reading...
module.rbac_platform_app["05ca3a17-bfc2-432e-aea2-81176c47f176"].data.azurerm_client_config.hub: Reading...
module.rbac_platform_app["05ca3a17-bfc2-432e-aea2-81176c47f176"].data.azurerm_client_config.hub: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD03MjQ0YzE3OS1kZTg2LTRjMDYtYTY3YS0xMTQ3N2ExNGNhMzc7b2JqZWN0SWQ9NmVhZWQyM2UtZGY3Zi00NzA4LTljOGUtYTdmMzRkZWVhZGI0O3N1YnNjcmlwdGlvbklkPTAxZGU0OWNiLTQ4ZWYtNDQ5NC1iYzlkLWI5ZTE5YTkwYmNkNTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
module.appsettings.data.azurerm_client_config.hub: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD03MjQ0YzE3OS1kZTg2LTRjMDYtYTY3YS0xMTQ3N2ExNGNhMzc7b2JqZWN0SWQ9NmVhZWQyM2UtZGY3Zi00NzA4LTljOGUtYTdmMzRkZWVhZGI0O3N1YnNjcmlwdGlvbklkPTAxZGU0OWNiLTQ4ZWYtNDQ5NC1iYzlkLWI5ZTE5YTkwYmNkNTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
module.rbac_platform_app["0abd3bf5-4c0c-432a-8475-f977adc816c8"].data.azurerm_client_config.hub: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD03MjQ0YzE3OS1kZTg2LTRjMDYtYTY3YS0xMTQ3N2ExNGNhMzc7b2JqZWN0SWQ9NmVhZWQyM2UtZGY3Zi00NzA4LTljOGUtYTdmMzRkZWVhZGI0O3N1YnNjcmlwdGlvbklkPTAxZGU0OWNiLTQ4ZWYtNDQ5NC1iYzlkLWI5ZTE5YTkwYmNkNTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
module.rbac.data.azurerm_client_config.hub: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD03MjQ0YzE3OS1kZTg2LTRjMDYtYTY3YS0xMTQ3N2ExNGNhMzc7b2JqZWN0SWQ9NmVhZWQyM2UtZGY3Zi00NzA4LTljOGUtYTdmMzRkZWVhZGI0O3N1YnNjcmlwdGlvbklkPTAxZGU0OWNiLTQ4ZWYtNDQ5NC1iYzlkLWI5ZTE5YTkwYmNkNTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
module.rbac_platform_app["0abd3bf5-4c0c-432a-8475-f977adc816c8"].data.azurerm_resource_group.hub: Reading...
module.rbac_platform_app["05ca3a17-bfc2-432e-aea2-81176c47f176"].data.azurerm_resource_group.hub: Reading...
module.appsettings.data.azurerm_resource_group.hub: Read complete after 0s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub]
module.rbac.data.azurerm_resource_group.spoke: Read complete after 1s [id=/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001yt01]
module.rbac.data.azurerm_servicebus_namespace.use_masstransit[0]: Reading...
module.rbac_platform_app["0abd3bf5-4c0c-432a-8475-f977adc816c8"].data.azurerm_resource_group.hub: Read complete after 1s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub]
module.rbac.data.azurerm_storage_account.use_lease[0]: Reading...
module.rbac_platform_app["05ca3a17-bfc2-432e-aea2-81176c47f176"].data.azurerm_resource_group.hub: Read complete after 1s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub]
module.rbac_platform_app["05ca3a17-bfc2-432e-aea2-81176c47f176"].data.azurerm_resource_group.spoke: Read complete after 1s [id=/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001yt01]
module.rbac.data.azurerm_storage_account.use_lease[0]: Read complete after 1s [id=/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001yt01/providers/Microsoft.Storage/storageAccounts/staltinnauth001yt01]
module.rbac.data.azurerm_resource_group.hub: Read complete after 2s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub]
module.rbac_platform_app["0abd3bf5-4c0c-432a-8475-f977adc816c8"].data.azurerm_resource_group.spoke: Read complete after 2s [id=/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001yt01]
module.rbac_platform_app["05ca3a17-bfc2-432e-aea2-81176c47f176"].data.azurerm_servicebus_namespace.use_masstransit[0]: Reading...
module.rbac_platform_app["0abd3bf5-4c0c-432a-8475-f977adc816c8"].data.azurerm_servicebus_namespace.use_masstransit[0]: Reading...
module.rbac_platform_app["05ca3a17-bfc2-432e-aea2-81176c47f176"].data.azurerm_storage_account.use_lease[0]: Reading...
module.rbac_platform_app["0abd3bf5-4c0c-432a-8475-f977adc816c8"].data.azurerm_storage_account.use_lease[0]: Reading...
module.rbac_platform_app["0abd3bf5-4c0c-432a-8475-f977adc816c8"].data.azurerm_storage_account.use_lease[0]: Read complete after 1s [id=/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001yt01/providers/Microsoft.Storage/storageAccounts/staltinnauth001yt01]
module.rbac.data.azurerm_servicebus_namespace.use_masstransit[0]: Read complete after 3s [id=/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001yt01/providers/Microsoft.ServiceBus/namespaces/sbaltinnauth001yt01]
module.rbac_platform_app["05ca3a17-bfc2-432e-aea2-81176c47f176"].data.azurerm_storage_account.use_lease[0]: Read complete after 2s [id=/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001yt01/providers/Microsoft.Storage/storageAccounts/staltinnauth001yt01]
module.rbac_platform_app["0abd3bf5-4c0c-432a-8475-f977adc816c8"].data.azurerm_servicebus_namespace.use_masstransit[0]: Read complete after 2s [id=/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001yt01/providers/Microsoft.ServiceBus/namespaces/sbaltinnauth001yt01]
module.rbac_platform_app["05ca3a17-bfc2-432e-aea2-81176c47f176"].data.azurerm_servicebus_namespace.use_masstransit[0]: Read complete after 3s [id=/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001yt01/providers/Microsoft.ServiceBus/namespaces/sbaltinnauth001yt01]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.rbac.azurerm_role_assignment.use_lease[0] will be created
  + resource "azurerm_role_assignment" "use_lease" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "483db230-b490-4b9d-9295-869669540c18"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001yt01/providers/Microsoft.Storage/storageAccounts/staltinnauth001yt01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.rbac_platform_app["05ca3a17-bfc2-432e-aea2-81176c47f176"].azurerm_role_assignment.use_lease[0] will be created
  + resource "azurerm_role_assignment" "use_lease" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "05ca3a17-bfc2-432e-aea2-81176c47f176"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001yt01/providers/Microsoft.Storage/storageAccounts/staltinnauth001yt01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.rbac_platform_app["0abd3bf5-4c0c-432a-8475-f977adc816c8"].azurerm_role_assignment.use_lease[0] will be created
  + resource "azurerm_role_assignment" "use_lease" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "0abd3bf5-4c0c-432a-8475-f977adc816c8"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001yt01/providers/Microsoft.Storage/storageAccounts/staltinnauth001yt01"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.out"
Releasing state lock. This may take a few moments...

```

</details>

| Context | Values |
| - | - |
| Pusher | @andreasisnes |
| Action | `push` |
| Working Directory | `src/apps/Altinn.AccessManagement/infra` |
| State File | `github.com/altinn/altinn-authorization-tmp/environments/yt01/altinn.accessmanagement.tfstate` |
| Plan File | `github.com_altinn_altinn-authorization-tmp_environments_yt01_altinn.accessmanagement.tfstate.tfplan`